#pragma once

// распад разрыва
/* 1)   x=[0;0.46]
2)   x=[0.46;0.61]
3)   x=[0.61;1]    */
//const double xx1 = 0.05, xx2 = 0.46, tt1 = 0.14; 0.295
//const double xx1 = 0.05, xx2 = 0.56, tt1 = 0.14; 0.295

// new calculations until t=0.3; no boundaries; no right parts

/* Rarification wave

1) x=[0;0.36]
2) x=[0.36;0.42]
3) x=[0:51;0:64] t=0.1
x=[0:56;0.78] t=0.2
*/

/* 2SW: 0.3-0.5 left, 0.65-0.9 right */
/* for RW: 0-1 distance */

/* очень хороший случай: 0.2-1, 0.245-0.5*/
//const double xx1 = 8, xx2 = 17, tt1 = 2.0;

// контур вокруг столкновения двух волн: 8, 17, 2.0, 5.0
// столкновение сильных волн (P_8): x[0.3, 0.8], y[0.16, 0.3]
// одна новая волна (P_8): x[0.7,0.95], y[0.2875,0.3625]

// 6 задача: 13, 18, 4.0, 7.0
// 8 задача: 8, 18, 0, 3
